import { useNavigate } from "react-router-dom"
import gradient from "../../../assets/photo/gradient.svg";

export default function RulesMain() {
  const navigate = useNavigate();

  return (
    <div className="container">
      <main className="aml-main">
        <h1>Правила</h1>
        <div className="aml-container-grid">
          <div className="aml-rules">
            <h1>ПРАВИЛА ПРОВЕДЕНИЯ ОБМЕННЫХ ОПЕРАЦИЙ</h1>
            <div style={{ whiteSpace: "pre-line" }} className="aml-text">
              1. <span>Общие положения</span>
              <br /><br />
              1.1. Этим Соглашением устанавливаются особенности предоставления Онлайн-сервисом обменных услуг. <br /> <br />
              1.2. Под Онлайн-сервисом понимается интернет-ресурс по обмену виртуальных денег – <span>Cryptocoinbank.com</span>. <br /><br />
              1.3. К Пользователям причисляют частных лиц и организации(й), выразивших согласие на сотрудничество с Онлайн-сервисом. <br /><br />
              1.4. При общем упоминании Пользователь и Онлайн-ресурс называются Сторонами. <br /><br />
              1.5. Стороны согласны, что это электронное Соглашение, обладает равной силой с письменным договором и призвано урегулировать их отношения в процессе потребления услуг обмена. <br /><br />
              1.6. Соглашение считается публичной офертой, акцепт которой происходит путем оформления Пользователем заявки для получения услуг, оказываемых Онлайн-сервисом. Заявка подается через веб-ресурс Cryptocoinbank.com.<br /><br />
              2. <span>Предмет Соглашения</span><br />
              2.1. Онлайн-ресурс Cryptocoinbank.com предоставляет услуги, перечень которых указан в п. 4 Соглашения, но Пользователь обязан следовать стандартам, изложенным в п. 9. "Порядок совершения обменных операций". Услуги оказываются в порядке, определенном Регламентом, положения которого прописаны в п. 5 Соглашения.<br /><br />
              2.2. Пользователь, совершивший обменную операцию, должен провести за нее оплату.<br /><br />
              3. <span>Взаимные обязательства Сторон</span><br />
              3.1. Онлайн-сервис <span>Cryptocoinbank.com</span> берет на себя следующие обязательства:<br /><br />
              3.1.1. Обеспечивать конвертацию электронных денег в направлениях, установленных сервисом на сайте, и придерживаться при этом стандартов, установленных данным Соглашением.<br /><br />
              3.1.2. Предоставлять поддержку информационного и технического характера Пользователям в ходе потребления ими оказываемых Онлайн-сервисом услуг.<br /><br />
              3.1.3. Гарантировать конфиденциальность сведений касательно совершения обменных операций (персональную информацию клиентов, время совершения транзакции, сумму) и передавать их Пользователям, совершившим соответствующие платежи. Если в процессе обмена принимала участие конфиденциальная система платежей, то такая операция получает статус «конфиденциальной» и не подлежит дальнейшему разглашению.<br /><br />
              3.1.4. Ограничить доступ посторонних лиц к данным о совершении платежа.<br /><br />
              3.1.5. Предоставлять Пользователю скидки в порядке, установленном Соглашением.<br /><br />
              3.1.6. Обеспечить перевод средств на счет Пользователя или третьего лица не позднее суток после поступления жалобы в ситуациях, перечисленных п. п. 3.2.5, 5.4—5.6 Соглашения.<br /><br />
              3.1.7. Хранить в тайне и не разглашать информацию по обменным операциям, а также личные данные Пользователя Интернет-сервиса третьим лицам, за исключением следующих ситуаций:<br />— по законному решению суда по месту нахождения владельца Интернет-сервиса;<br />— по законному запросу компетентных органов по месту нахождения владельца Интернет-сервиса;<br />— по запросу администрации одной из платежных систем, а именно Perfect Money, OKPAY, Payeer, Qiwi, Яндекс. Деньги и другие.<br /><br />
              3.2 <span>Пользователь берет на себя следующие обязательства:</span><br /><br />
              3.2.1. Передавать Онлайн-сервису максимально точные сведения для обеспечения оперативного проведения обмена.<br /><br />
              3.2.2.Обозначать правдивые реквизиты своего электронного адреса.<br /><br />
              3.2.3. Создать возможности для получения оповещений от системы на электронную почту. Обеспечивать доступ к сети при помощи компьютера либо иного устройства. Установить антивирусные программы, чтобы соединение с Онлайн-ресурсом было максимально защищенным.<br /><br />
              3.2.4. Выполнять требования этого Соглашения.<br /><br />
              3.2.5. Ставить в известность администрацию ресурса, если средства полностью либо частично не были зачислены на счет получателя. А также обо всех ситуациях, когда имели место обстоятельства, указанные в п. п. 5.4—5.6 этого Соглашения. Уведомление следует отправить в администрацию не позднее месяца после наступления соответствующего инцидента. Невыполнение этого требования приводит к перечислению спорных сумм на счет Онлайн-сервиса.<br /><br />
              3.2.6. Соблюдать законы своей страны нахождения и гражданства.<br /><br />
              3.2.7. Не нарушать требований нормативных актов, устанавливающих особенности проведения обмена в режиме онлайн.<br /><br />
              3.2.8. Предоставлять все необходимые данные и проходить процедуру подтверждения личности в любое время по требованию Администрации Онлайн-сервиса согласно п.10 настоящего Соглашения.<br /><br />
              3.3 <span>Права онлайн-сервиса Cryptocoinbank.com:</span><br /><br />
              3.3.1. На время останавливать работу сервиса для устранения неполадок и проведения модернизации.<br /><br />
              3.3.2. Остановить проведение транзакции, если поступило обращение компетентных органов, партнеров либо жалоба Пользователя на мошеннические действия. Обмен останавливается на время, необходимое для выяснения ситуации.<br /><br />
              3.3.3. По своему усмотрению устанавливать систему скидок на обменные операции. Скидка на обмен не учитывается, если обменный сервис не получает прибыль по заявке, т.е. процент обмена отрицателен или равен 0.<br /><br />
              3.3.4. Устанавливать и изменять комиссии за проведение обмена.<br /><br />
              3.3.5. Ограничить потенциального Пользователя в доступе к своим услугам, не объясняя мотивов отказа.<br /><br />
              3.3.6. Если в процессе обмена совершена ошибка, то Онлайн-сервис вправе потребовать от Пользователя подтверждения совершенной операции при помощи средств связи, электронной почты, скриншота виртуального портмоне.<br /><br />
              3.3.7. Прервать разговор с Пользователем, который неадекватно себе ведет либо ограничивает сотрудников в получении данных, необходимых для решения его вопроса.<br /><br />
              3.3.8. Блокировать осуществление платежа в случаях, предусмотренных п.п. 5.4—5.6 этого Соглашения либо Регламентом.<br /><br />
              3.3.9. Блокировать перевод, заблокировать аккаунт и не возвращать денежные средства до полной идентификации личности Пользователя согласно п.10 настоящего Соглашения.<br /><br />
              3.4. Служба безопасности сервиса в праве заморозить заявку клиента в случае, если он каким либо способом получил незаконное обогащение в данном или стороннем обменном сервисе и находится в списке должников, до выяснения причин и возмещение убытков понесенных обменниками от данного пользователя.<br /><br />
              3.5. Обменный сервис оставляет за собой право пересмотрения условия вознаграждения в реферальной программе.<br /><br />
              3.6. Реферальные вознаграждения могут не начисляться, если обменный сервис получает прибыль менее 0.6% (данное решение остаётся на усмотрении администрации сервиса Cryptocoinbank.com)<br /><br />
              3.7. Реферальные начисления можно вывести, если у пользователя на балансе партнёрского кабинета не менее 25$ (эквивалент цифрового доллара, stable coin).<br /><br />
              3.8. Онлайн-сервис в праве приостановить операцию в случае выявления цели извлечения клиентом прибыли на разнице курсов обменного сервиса. В данном случае заявка блокируется до выяснения обстоятельств администрацией сервиса.<br /><br />
              3.9. Сервис в праве пересчитать курс, зафиксированный по заявке, в случае:<br />— длительной задержки поступления средств от клиента к сервису, по причине задержки со стороны стороннего сервиса.<br />— клиент указал минимальную комиссию при переводе за транзакцию, что привело к длительной задержке поступления средств на счёт сервиса.<br /><br />
              4. <span>Предоставляемые услуги.</span><br />
              4.1. Cryptocoinbank.com проводит обменные операции электронных денег таких систем платежей, как Bitcoin, Ethereum, USDT, TON. В совершении платежей принимают участие банки, перечень которых имеется на сайте;<br /><br />
              5. <span>Регламент совершения обменных операций</span><br />
              5.1. Обмен начинается по факту перечисления денег от Пользователя.<br /><br />
              5.2. Обмен считается завершенным после перечисления денег на предоставленные Клиентом реквизиты.<br /><br />
              5.3. Пользователь не вправе отменить операцию уже после ее начала либо требовать возврата средств, переданных для обмена.<br /><br />
              5.4. Если Пользователь перечислил сумму, величина которой не совпадает с реквизитами, обозначенными при оформлении обмена, то Онлайн-сервис вправе остановить операцию либо провести операцию учитывая полученнную Онлайн-сервисом сумму. Также, по факту обращения Пользователя в порядке п. 3.2.5 Онлайн-сервис проводит обмен фактически перечисленной суммы с учетом курса, актуального на момент начала транзакции.<br /><br />
              5.5. При указании некорректного счета обмен не производится. Деньги возвращаются Пользователю по его заявлению на основании п. 3.2.5.<br /><br />
              5.6. Если Пользователь произвел корректировку суммы платежа либо осуществил оплату с чужого аккаунта, то Онлайн-сервис вправе заблокировать такой платеж. Возврат средств происходит по заявлению Пользователя на основании п. 3.2.5.<br /><br />
              5.7. Если пользователь обменника проводит обмен в направлении криптовалюты Биткоин, т.е. меняет любую из представленных в сервисе на Биткоин, то следует иметь ввиду, что транзакции в сети Биткоин проходят от 15 минут до нескольких суток. Это никаким образом не зависит от обменника Cryptocoinbank.com и он не может повлиять на ситуацию или ускорить обработку транзакции.<br /><br />
              5.8 Поступления денежных средств в направлении банковских платежных систем (пример Visa, Master Card, Мир) может составлять до 5 (пяти) банковских дней.<br /><br />
              5.9 Клиент обязуется произвести оплату по заявке в течении 20 минут, в противном случае заявка будет автоматически удалена. Курс по заявке фиксируется в момент создания заявки. ниже прописаны возможные форс мажоры из-за курсовых колебаний.<br /><br />
              5.10 В любом случае, когда осуществляется возврат средств — удерживается комиссия в размере 5%.<br /><br />
              5.11 Исполнитель может взимать комиссию в размере 5% + комиссию за перевод в том случае, когда исполнитель не может выполнить заявку (отправить денежные средства клиенту на карту) по причинам того, что банковская карта у заказчика заблокирована или находится в подозрении о мошенничестве у служб безопасности банка.<br /><br />
              При изменении курса (РЕЗКИХ СКАЧКАХ/КОЛЕБАНИЙ) в заявке более чем на 0.3%, заявка пересчитывается по актуальному курсу.<br /><br />
              6. <span>Ответственность Сторон и гарантии Онлайн-сервиса</span><br />
              6.1.Ресурс — обменник Cryptocoinbank не несет никакой юридической ответственности за последствия неправильного использования сервиса или за ошибки, сделанные Пользователем во время заполнения заявки для совершения обмена виртуальной валюты. Отмена платежа не проводится, даже если деньги были отправлены на неверный счет.<br /><br />
              6.2. Онлайн-сервис не оплачивает ущерб, возникший в результате потери работоспособности оборудования в целом либо его отдельных частей, которые используются Пользователем в ходе обмена.<br /><br />
              6.3. Онлайн-сервис не отвечает за задержки платежа либо допущенные в его процессе неточности, возникшие вследствие действий банков или систем платежей. Обменник не несет ответственности за последуюющие после обменной операции, возможные, блокировки банковских карт и аккаунтов платёжных систем пользователя.<br /><br />
              6.4. <span>Cryptocoinbank.com</span> не отвечает за издержки и убытки Пользователя, возникшие вследствие ошибочных представлений последнего касательно тарифов, выгодности обмена либо иных субъективных моментов.<br /><br />
              6.5. Онлайн-сервис <span>Cryptocoinbank.com</span> не компенсирует затраты, причиной которых стали задержки либо ошибки в процессе совершения обмена.<br /><br />
              6.6. Пользователь подтверждает наличие законных оснований для распоряжения средствами, принимающими участие в совершении обмена.<br /><br />
              6.7. Все убытки третьих лиц, возникшие вследствие использования ресурсов Онлайн-сервиса Пользователем, компенсируются последним в полном объеме, за счёт возврата и вычета из будущих заявок.<br /><br />
              7. <span>Порядок изменения условий работы</span><br />
              7.1.Администрация <span>Cryptocoinbank.com</span> вправе в любое время внести изменения или дополнения в настоящее Соглашение. Они приобретают силу и начинают действовать после их обнародования на ресурсе<br /><br />
              8. <span>Непредвиденные обстоятельства</span><br />
              8.1. При возникновении непреодолимых обстоятельств Стороны освобождаются от наступления ответственности за невыполнение либо несвоевременное выполнение условий данного Соглашения. Под непреодолимыми обстоятельствами понимаются война, теракт, пожар, наводнение, беспорядки, хакерское проникновение, акты местных властей. Также к ним относится сбой в энергоснабжении и отсутствие доступа к сетям, в числе которых Интернет и услуги связи.<br /><br />
              8.2. Уважаемые клиенты, участились случаи попадания платежа в обработку на банки Сбербанк, Тинькофф, Газпромбанк, Райффайзенбанк, платёж может идти более 72-х часов, тогда сроки выполнения заявки переносятся до полного зачисления средств на счёт заказчика.<br /><br />
              9. <span>Порядок совершения обменных операций</span><br />
              9.1. Онлайн-сервис нельзя использовать для проведения незаконных операций. Пользователь дает согласие на привлечение к ответственности за попытку обмена сомнительных средств, в соответствии с нормами государства, в пределах которого совершено нарушение.<br /><br />
              9.2. Если будет доказана незаконность платежа, то Онлайн-сервис вправе предоставить информацию об этом по требованию правоохранительных органов, системы платежей либо потерпевшей стороны.<br /><br />
              9.3. Для совершения обмена Пользователь должен вывести со своего виртуального портмоне (кошелек) соответствующее количество электронных денежных знаков. При этом он лично отвечает за наличие правовых оснований для зачисления денег на кошелек, поскольку проверка законности этой операции не входит в компетенцию Онлайн-сервиса.<br /><br />
              9.4. Осуществление банковского перевода возможно в рамках интернет-банкинга системы платежей. Если оформление заявки происходило через банковского оператора или банкомат, то деньги не позднее суток возвращаются Пользователю. При переводе на карту Сбербанка Пользователь должен уплатить 1% от величины платежа. Возвращение средств происходит исключительно по факту определения службой безопасности отправителя перевода.<br /><br />
              9.5. Онлайн-сервис не несет ответственности за платежи, выполненные по согласию Пользователя третьими лицами.<br /><br />
              9.6. Пользователь принимает Соглашение в полном объеме путем активации кнопки «я согласен с правилами обмена».<br /><br />
              10. <span>Подтверждение личных данных</span><br />
              10.1. Для подтверждения личности Администрация Онлайн-сервиса имеет право запрашивать, но не ограничивается ими, следующие данные:<br /><br />
              Фамилия, имя и отчество Пользователя.<br />
              Паспортные данные в полном объеме.<br />
              Сведения о гражданстве и/или двойном гражданстве.<br />
              Любые данные о дате и месте рождения Пользователя.<br />
              Любые данные о месте регистрации и/или проживания Пользователя.<br />
              Фотографии паспорта, ID-карты, загранпаспорта, водительского удостоверения.<br />
              Собственные фотографии пользователя с документом подтверждающим личность (паспорт) в руке.<br />
              Любые квитанции оплаты коммунальных услуг с данными Пользователя и местом его проживания.<br />
              Любые другие данные, которые Администрация Онлайн-сервиса посчитает необходимыми для прохождения полной идентификации личности.<br /><br />
              10.2. Сбор, обработка и хранение всех полученных данных в ходе прохождения процедуры подтверждения личности Онлайн-сервисом будет выполняться в соответствие с Политикой конфиденциальности.<br /><br />
              10.3. Онлайн-сервис будет использовать всю получаемую информацию о Пользователе в ходе прохождения процедуры подтверждения личности, но не ограничиваясь этими данными, для контроля финансовых операций и предотвращения нарушения законов в области отмывания денежных средств и финансирования терроризма.<br /><br />
              10.4. Пользователь дает свое согласие Онлайн-сервису на учет, обработку и хранение всех данных об активности Пользователя и его личных данных в течение всего времени пользования Пользователем сервиса.<br /><br />
              10.5. Пользователь дает свое согласие Онлайн-сервису на проведение расследований и использование при этом его персональных данных, данных о проводимых транзакциях и/или любых других данных связанных с ним, для предотвращения преступлений, нарушений законодательства, предотвращения процессов способствующих отмыванию денежных средств и финансированию терроризма.<br /><br />
              10.6. После предоставления данных Пользователем Онлайн-сервису путем внесения их в специальные поля при регистрации и/или прохождении процедуры идентификации личности, Пользователь самостоятельно несет ответственность за их актуальность. В случаях когда Администрация Онлайн-сервиса не сможет связаться с Пользователем по указанным контактным данным продолжительное время (более 72 часов) Администрация Онлайн-сервиса имеет право заблокировать аккаунт и все средства на нем до получения ответа от Пользователя.<br /><br />
              10.7. Для проведения процедуры идентификации личности (KYC) Пользователь дает свое согласие Онлайн-сервису на привлечение специализированных сервисов (третью сторону).<br /><br />
              10.8 Пользователь дает согласие на проверку всех проводимых на Онлайн-сервисе транзакций. Адреса кошельков всех проводимых транзакций пройдут автоматическую AML-проверку на предмет причастности к таким понятиям как:<br /><br />
              Darknet Service<br />
              Illegal Service<br />
              Mixing Service<br />
              Darknet Marketplace<br />
              Scam<br />
              Fraudulent Exchange<br />
              Stolen Coins<br />
              Ransom<br />
              Sanctions<br />
              Child exploitation<br />
              Terrorism financing<br />
              Exchanges linked with money laundering<br />
              Suspicious exchanges / p2p exchanges<br />
              В случае выявления связи, Пользователю будет необходимо пройти процедуру подтверждения личных данных. Только после прохождения процедуры, переводимые средства могут быть возвращены Пользователю на усмотрении Администрации сервиса SecuredChange.com, за вычетом комиссии в размере 10%.<br /><br />
              11. <span>Риски связанные с использованием криптовалют</span><br />
              11.1 Любые операции с криптовалютами квалифицируются как инвестиции с высоким уровнем рисков. Проводя какие-либо операции, пользователь должен убедиться, что обладает достаточными знаниями и полностью осознает все возможные риски.<br /><br />
              Торговля криптовалютой сопряжена со значительными рисками. Основным отличием от фиатных валют можно определить то, что ее курс и эмиссия не поддерживается каким-либо правительством или центральным банком, способным увеличить рыночную стоимость и доступность к покупке/продаже. Электронная валюта представляет риск возможного обесценивания в случае потери доверия пользователей к ней, которое может быть подорвано действиями ее создателей, изменениями в поддержке программного обеспечения, появлением альтернативных валют в следствии форка, ограничениями и запретами на криптовалюты, введенными различными государствами. Кроме того, доверие к валюте, а следовательно и стоимость, может снизиться из-за системных технических проблем и действий хакеров. Учитывая это, при торговле криптовалютой существует высокий риск и возможность потерять все вложенные в нее средства.<br /><br />

              <span>Администрация сайта Cryptocoinbank.com не несет ответственности за обеспечение курса торговли, за финансовые потери, понесенные пользователями, а также за любые другие действия, совершенные пользователем на данной, либо другой площадке.</span><br /><br />

              <span>Администрация сервиса не несёт ответственности за ваши расчеты комиссий сети, соответственно любые задержки в сети блокчейна, по причине уплаты низкой комиссии с вашей стороны, либо другой иной причины связанной с сетью, не являются нашей ответственностью. Некоторые транзакции могут идти неделями, в связи с уплатой низкой комиссии и загрузкой сети. Более подробно в секции комиссия сети.</span><br /><br />

            </div>
          </div>
          <div className="aml-right-container">
            <div className="aml-login-container">
              <p>Авторизация</p>
              <form className="auth-form">
                <span>Логин или e-mail *:</span>
                <input type="text" />
                <span>Пароль *:</span>
                <input type="password" />
              </form>
              <button className="aml-login-button">Войти</button>
              <div className="reg-link-row">
                <span className="reg-link" onClick={() => navigate("/signup")}>Регистрация</span>
                <span>|</span>
                <span className="reg-link" onClick={() => navigate("/reset-password")}>Забыли пароль?</span>
              </div>
            </div>
            <div className="aml-login-container">
              <p>Проверка статуса заявки</p>
              <form className="auth-form">
                <span>ID обмена:</span>
                <input type="text" />
                <span>Email:</span>
                <input type="text" />
              </form>
              <button className="aml-login-button status">Проверить статус</button>
            </div>
          </div>
        </div>
        <img src={gradient} alt="gradient" className="gradient gradient-a1"/>
        <img src={gradient} alt="gradient" className="gradient gradient-a2"/>
        <img src={gradient} alt="gradient" className="gradient gradient-a3"/>
        <img src={gradient} alt="gradient" className="gradient gradient-a4"/>
        <img src={gradient} alt="gradient" className="gradient gradient-a5"/>
        <img src={gradient} alt="gradient" className="gradient gradient-a6"/>
        <img src={gradient} alt="gradient" className="gradient gradient-a7"/>
        <img src={gradient} alt="gradient" className="gradient gradient-a8"/>
        <img src={gradient} alt="gradient" className="gradient gradient-a9"/>
      </main>
    </div>
  )
}